"About KEAD > About KEAD | KEAD\nGo to main content\nAbout KEAD\nAs an affiliated organization under the Ministry of Employment and Labor, Korea Employment Agency for\r\n                Persons with Disabilities(KEAD) was established 1990 with the mission of becoming the leading agnecy to\r\n                employ persons with disabilities.\nKEAD has more than 1,300 full-time workers at 6 regional headquarters, 14 branch offices, 5 vocational\r\n                competency development institutes 27 training centers, and assistive technology center. Its business\r\n                expands across multiple services for persons with disabilities, which include job placement, vocational\r\n                training, assistive technology device support and personal assistance.\nFor employers, KEAD provides employment subsidy and extends support for establishing standard workplace,\r\n                fund for the work environment improvment, etc.\nBy providing various employment services, KEAD will continue to strive to create a society where persons\r\n                with disabilities can work together.\nPurpose of Establishment and What We Do\nPurpose and Basis for Establishment\nPurpose\nTo contribute to the employment promotion, vocational rehabilitaion and employment of persons with\r\n            disabilities and support business employers\nLegal Basis\n「Disability Employment Promotion and Vocational Rehabilitation Act」\nSupport Area\nEmployment Support\nFrom pre-employment preparations to job adaptation, KEAD provides assistive technology devices, personal\r\n            assistance services, and workplace counselor services to promote employment stability\nEmployer Support\nTo support business owners employing persons with disabilities, KEAD provides disability employment\r\n            incentives such as establishing standard work places, free equipment, loans, barrier-free certification, and\r\n            employment management funds\nVocational Training\nKEAD provides vocational training, customized training, and training specific for developmental disabilities\nResearch & Development\nKEAD conducts a research on disability employment policies to enhance employment conditions for persons with\r\n            disabilities\nInternational Cooperation\nKEAD shares disability employment policies with overseas agencies and provide aid to the developing\r\n            countries\nRelated law"