"Employment Support  for Employers > Improvement of Work Environment | KEAD\nGo to main content\nStandard Workplace\nThis system aims to create a base for social integration by creating environments friendly towards persons with severe disabilities. Employers who meet these requirements are provided with funds to install, purchase, and tax benefits for their business operation.\nConditions\nHiring ten or more PWDs or a number equal to 30% or more of all regular employees (the severe disability employment quota to be differentially applied depending on the number of regular employees)\nMaintaining amenities under the Act on the Guarantee of Convenience Promotion of Persons With Disabilities, Senior Citizens, Pregnant women, and nursing Mothers\nPaying wages above the minimum wage to PWD employees pursuant to Article 5 of the Minimum Wage Act\nUpper Limits and Conditions\nFinancial support for amounts equivalent to three-fourths of smaller amounts between actual investment falling under the purposes of financial assistance and amounts calculated by KEAD\nUp to KRW 1 billion depending on the number of newly hired PWDs (KRW 30 million per new PWD)\nEstablishments must be certified by satisfying all standard workplace criteria (Article 3 of the Enforcement Rule of the Act) and retain PWD employment for seven years from the month that they first implement the disability employment obligation\nPurpose of Financial Support\nExpenses for installation, purchase, repair, or improvement of work facilities, appurtenances, or amenities (excluding expenses for lease deposits or land purchase)\nExpenses for vehicles for PWD commuting\nSubsidiary-type Standard Workplace\nThe Subsidiary-type Standard Workplace for PWDs is a system, in which, when a parent company obliged to employ PWDs establishes a subsidiary that meets certain requirements(holding 50% of totla investment amounts or the total number of issued stocks) to employ PWDs, and those hired by subsidiaries are considered employed by the parent company.\nBy including PWDs hired by such subsidiaries in the parent company’ workforce, charges will be reduced or exempted.\nUp to KRW 1 billion grant may be provided to business owners of subsidiary-type standard workplaces.\nTax cuts will be provided according to the Restriction of Special Taxation Act. (Subsidiary-type PWD standard certified by December 31, 2022 may be exempted for corporate/income taxed by 100% for the first three years and 50% for the following two years.)\nCustomized Training Operation Process\nBusinesses owners obliged to employ PWDs according to Article 28 of the Disability Employment Promotion and Vocational Rehabilitation Act\n* Two or more obliged businesses owners can establish a subsidiary via joint investment.\n(first)Parent Company\n-Business owners obliged to hire PWDS (with 50 or more regular employees)  ( when  this step to  subsidiary step :\nOne company\n- to hold more than 50% of investment or stocks,\nTwo or more businesses\n- possible joint-investment )\n(second)Subsidiary\n- Ten or more PWD employees, At least 30% of all employees should be PWDS, \r\n   Differentiated employment of the severely disabled depending on the number of regular employees*,Convenience facilities must be established,\r\n   Payment of wages above minimum wage, ( when this step to second step - parent company  : To be added to the parent company' employment rates (charge reduction / exemption) )"