"Employment Support  for Employers > Employment Consulting | KEAD\nGo to main content\nWhat is Disability Employment Consulting?\nEmployment consulting refers to a service that provides customized PWD employment solutions by analyzing\r\n        circumstances facing the government/public agencies and private businesses and comprehensively linking and\r\n        providing KEAD support programs, all with the goal of realizing social value. Jobs at establishments are\r\n        analyzed as are the current states of PWD employment so that solutions and professional services for the pre-,\r\n        during, and post-employment phases can be provided. In this process, KEAD sometimes signs memoranda of PWD\r\n        employment promotion with agencies or firms wishing to expand PWD employment.\nEligible Applicants\nGovernment/public agencies and businesses with low disability employment\nAgencies and businesses wishing to hire PWDs (including establishment units)\nProcedure\nAfter identifying or creating jobs suitable for PWDs via job analysis through visits to applicants, the analysis\r\n        results (including analysis content, suggestions, and plans to provide applicant-requested programs) will be\r\n        sent to companies/agencies in concern.\nComprehensive Consulting Procedures\n(step A)Request from the Consultation\n(step A)Consultation\n(step B)Job offer request\n(step B)Job offer advertisement\n(step C)Candidate Recommendation\n(step C)Screening process\n(step D)Employment management assistance\n(step A)Consultation on current status and promotion plan of disability employment\n(step B)Job analysis and recommendation\n(step c)Consultation on current status and promotion plan of disability employment\n(step D)Various employment maintenance services\nTo expand decent jobs for PWDs, KEAD collaborates with the Ministry of Employment and Labor to enhance and\r\n        improve the mandatory employment quota, develop new policies, and hold promotional or discussion meetings to\r\n        secure PWD jobs with local governments, public agencies, and large businesses."