"Employment Support  for Employers > Disability Employment  Incentives/Levy | KEAD\nGo to main content\nIncentives are given to employers exceeding the disability employment quota(3.1% for private companies, 3.8% for\r\n        public agencies and local governments)\nProvides incentive support as long as the employment rate exceeds the mandatory quota\nAssistance Details\nInformation about details of assistance : by severe and less severe disability (a\r\n                man and woman)\nCategory\nLess severe Disability\nSevere Disability\nMen\nWomen\nMen\nWomen\nSince 2023\nKRW 350,000\nKRW 500,000\nKRW 700,000\nKRW 900,000\nDisability Employment Levy\nThe levy was introduced to compensate for expenses incurred from hiring PWDs by balancing the economic\r\n            burdens of employers\r\n            that hire PWDs with those that do not, while reflecting the philosophy of the collective responsibility of\r\n            society.\nLevies are used for a variety of disability employment promotion programs, including loans and subsidies.\nLevies are imposed on employers failing to meet the disability employment quota.\nTargets\nEmployers with an average of 100 or more monthly regular employees\nPrivate business owners, heads of national agencies and local governments, superintendents,\r\n            heads of public agencies and local public corporations must report\nReports must be made if the average number of monthly regular employees exceeds 100 even if the number of\r\n            regular employees for a certain month is below 100.\nRegular employees: employees who provide labor for 16 or more days a month\nExcluding those working fewer than 60 hours (except for persons with severe\r\n            disabilities)\nInitial levy amounts\nThe sum an average of expenses for installation and repair of equipment/facilities needed for disability\r\n            employment, disability\r\n            employment management, and other special disability employment expenses that is used for disability\r\n            employment and\r\n            calculating levies is set by the Employment and Labor Minister each year after deliberation by the\r\n            Employment Policy Council\nLevy-adding System\nDepending on the level of employment obligation implementation, initial levies are calculated and imposed\r\n            for shortfalls from the quota.\nInformation about Employment Quotas type, target: Private Companies, public\r\n                Officials, Non-public Officials, public Agencies for Persons with Disabilites\ntype\ntarget\nquotas\nDisability Employment Quota\nPrivate Companies\n3.1%\nNational/Local Goverments(Public\r\n                        Officials)\n3.8%\nNational/Local Govermments(Non-public\r\n                        Officials)\nPublic Agencies"