"KEAD\nGoto main content\nBetter Jobs for Persons with\nDisabilities, Better World for All!\nWhat’s News\nEmployment Support for PWDs\nEmployment Support for Employers\nVocational Training\nNews & Notice\nVisits from foreign institutions\nThis year, Korea Employment Agency for Persons with Disabilities(KEAD) had a number of international visitors.\nOn 7 August, the ILO(International Labor Organization) officials located in Geneva visited the Seoul Southern Developmental Disability Training Center to learn about Korea's disability employment policy and experience the vocational training for persons with disabilities\nin the institution.\nOn 7 Septemb\ner, government officials from the local government of Quang Chi Province, Vietnam\n; on 18 October the Ministry of Labor, Invalids and Social Affairs, Vietnam; On 31 October, Telecommunication and Information Accessibility Agency from\nIndonesia visited KEAD Guro Digital Training Center.\nAfter the tour, KEAD provided policy explanations on how Korea\nhave developed disability employment policy\nfor the past 32 years to increase the employment rate for pwds.\n2023-11-10\nPublications\nKEAD New Job Development Project\n2024-09-09\n2024 KEAD Leaflet\n2024-06-25\n2023 Disability Statistics at a Glance\n2023-10-06\nNewsletter\nKEAD_Newsletter_Issue190\nLearn more\nKEAD_Newsletter_Issue189\nJoin Newsletter\nPhoto Gallery\nphoto gallery\nLearn More\nprev\nHO CHI MINH Officials Visit\nAzerbaijani Delegation Visit\nKEAD Attended RI General Assembly and World Congress 2024 in UAE\nKEAD and ISKUR signed MOU to a Memorandum of Understanding(MOU)\nKEAD  completed &apos;Capacity Building Program on Disability Employment Policies&apos; in Vietnam, Hanoi\nnext\nKead Video\nLearn More\nprev\nThe 10th International Abilympics 2023, France Metz\n제 10회 국제장애인기능올림픽대회\n2023-03-27\n2022 Duo Day\nin '대한장애인 체육회 이천선수촌'\n2022-08-12\nEmployment policy and business introduction for the disabled\n2021-02-17\nStart Today With\nKorea Employment Agency for Persons with Disabled\n2020-10-05\nnext\nEmployment Development Institute\nRelated Law\nContact Us"