"공단소개 > 직원채용 > 교육훈련 상세 | 한국장애인고용공단\n본문바로가기\n한국장애인고용공단(KEAD)은 인간존중 가치를 실현하는 초일류 장애인고용전문기관을 선도해갈 핵심인재를 발굴 · 양성하기 위한 다양한 교육훈련프로그램을 운영하고 있습니다.\n\\\r\n                            한국장애인고용공단의 교육훈련은 공통교육, 직무분야별 전문교육, 직급별 기본교육, 해외연수, 위탁교육등으로 구성\n경력개발제도\n조직의 장기인력계획(workforce planning)과 직원 개인의 희망, 역량에 따라 개인별 전문분야와 경력경로(career path)를 설정하여 장래의 핵심인재로 육성합니다.\n1. 개인 : 자신의 희망과 적성을 고려, 장래경력경로설계, 전문성축적등 자기능력개발 .\r\n                           2. 조직 :  다양한 직무체험 기회, 교육훈련 기회부여, 경력관리 상담 조언등.\r\n                            (1.개인은 희망직무 및 보직경로 선택 2.조직은 CDP지원-경력정보제공, 지원)\r\n                            (1. 개인 - 성장욕구 충족, 능력개발, 2. 조직 - 전문인력 양성, 핵심인재 확복 )\n전문가(SME) 양성\n공단의 각종 직위중 전문성이 필요한 직위를 전문직위로 적극 지정하여 중하위급 직원이 해당분야에서 장기근무할 수 있도록 함으로써 관련 전문가(SME ; Subject Matter Expert)를 양성합니다.\n전문직위 기준\n직무내용에 따라 국제분야와 핵심분야 전문직위로 구분\n국제분야 전문직위\n대외적 협력 · 교류 및 조사 · 연구 등에 관한 업무 등을 주로 담당하는 직위\n핵심분야 전문직위\n주요 핵심업무중 장기간의 직무경험 또는 특수한 전문성 등이 요구되어 장기근무가 필요한 직위\n전문직위는 3급상당 이하 직원의 담당직위로 하되 국제분야 전문직위는 조직내 인력풀을 고려하여 관리자급까지 확대\n직급별교육\n직렬체계 단순화에 대비하여 직급별 기본교육을 계층별 교육으로 전환하여 전직렬을 대상으로 운영하고 직류별로 맞춤형 혁신교육 프로그램을 개발하여 혁신역량 강화를 위하여 지원하고 직류별 기본직무 능력배양을 위하여 공통직무교육과정과 선택직무 교육과정을 신설하여 차별화된 프로그램 개발 운영합니다.\n직급별 5급으로 구분: 1급, 2급, 3급, 4급, 5급  /  \r\n                               현행 : 1급-고급관리자과정, 2급-중급관리자 과정, 3급-초급관리자과정, 4급-경력직원중급과정,5급-경력직원초급과정 / \r\n                               개선:  1급과 2급은 고급, 중급 관리자 과정에서 핵심리더과정(관리자재직과정)으로 개선, 3급은 초급관리자 과정에서 핵심리더 및 신입리더과정으로 개선,  4급은 경력직원중급과정에서 실무리더중급과정으로 개선 , 5급은 실무리더초급과정으로 개선되며 이 모든 과정은 직무교육과정에 포함된다.\n직문분야별 전문교육\nKEAD는 조직구성원 모두가 장애인 고용분야에서 최고의 전문성을 갖은 인재로 커나갈 수 있도록 고용촉진, 고용지원, 경영관리 등 분야별로 필요한 전문지식과 기술향상을 위한 교육을 실시하고 있습니다.\n공통교육\nKEAD는 올바른 가치관을 가지고 끊임없이 도전하는 인재를 양성하고자 다양한 교육프로그램을 운영합니다. 고객을 지향한 수화교육, 글로벌 감각을 위한 어학교육, 디지털 마인드를 위한 IT교육, 혁신전략 확산을 위한 혁신강좌 등 다양한 교양교육을 통해 KEAD를 주도해 갈 인적자원 육성을 위해 교육훈련 인프라를 구축하고 있습니다.\n고용휴직제 도입\n공단은 정부 또는 민간기업 등과의 인사교류를 통해 정부부문과의 협력체계를 강화하여 경쟁력을 제고하고, 민간부문의 경영기법 및 업무수행방법 등을 습득하여 활용함으로써 상호 이해 증진 및 인재양성을 도모할 계획입니다.\n자발적 참여를 통한 학습문화 조성\n셀프리더십(Self-Leadership) 배양을 통한 개인과 조직의 우수성을 지향하기 위하여 변화를 위한 'ME & VISION' 프로그램을 도입하여, 참여에 이어진 성취의 경험과 가치 공유를 통해 조직내 활력을 부여하기 위하여 참여의 장을 마련할 예정입니다.\n사회공헌 볼런티어(Volunteer)활동 지원\n현장체험교육을 사회공헌 자원봉사활동으로 전환하여 본부 각 국 · 실 및 소속기관별 ‘KEAD-Volunteer단’을 구성 · 운영하고 기관별 1사 1시설 자매결연 및 정기적 봉사활동 실시를 하고 있습니다.\n위탁교육\nKEAD의 정책방향을 선도해가는 핵심리더의 전문소양과 네트워크 구축을 위해 국내 우수대학원의 교육컨텐츠를 활용하여 위탁교육을 실시하고 있습니다. 향후 핵심인재 발굴, 육성을 위한 KEAD-MBA 등을 계획하고 있습니다.\n해외연수\nKEAD는 해외 장애인 유관기관의 연구 및 교육훈련 등 우수한 프로그램을 벤치마킹하고 국제협력을 강화하기 위해 장 · 단기 해외연수를 실시하고 있습니다."